import torch

# Устройства
DEVICE = "cuda:0" if torch.cuda.is_available() else "cpu"

# Общие гиперпараметры
embedding_model_name = "openbmb/MiniCPM-o-2_6-int4"
BATCH_SIZE = 64
EPOCHS = 25
EMBEDDING_DIR = "path_to_your_emb_dir"  # emb must be [N, 64, 3584] - MiniCPM-o 2.6 int4
CHECKPOINT_PATH = "C:\RTK-Silhouette-Detector\models\MiniCPM-o 2.6int4 weights.pt"

ATT_KEYS = ['пол', 'возраст', 'голов_убор', 'цвет_верх', 'тип_низ', 'тип_верх', 'тип_низ', 'сумка_спина', 'сумка_рука']

# Классы атрибутов
ATT_CLASSES = {
    "пол": 3,
    "возраст": 6,
    "голов_убор": 7,
    "цвет_верх": 13,
    "цвет_низ": 13,
    "тип_верх": 8,
    "тип_низ": 4,
    "сумка_спина": 3,
    "сумка_рука": 3
}

# Текстовые метки для predict.py
ATT_LABELS = {
    "пол": ["мужчина", "женщина", "не определен"],
    "возраст": ["0-9 лет", "10-16 лет", "17-35 лет", "36-50 лет", "50+ лет", "не определен"],
    "голов_убор": ["шапка", "шляпа", "кепка", "капюшон", "платок", "отсутствует", "не определен"],
    "цвет_верх": ["желтый", "зеленый", "синий", "голубой", "красный", "розовый", "белый", "черный", "серый",
                  "коричневый", "оранжевый", "фиолетовый", "не определен"],
    "цвет_низ": ["желтый", "зеленый", "синий", "голубой", "красный", "розовый", "белый", "черный", "серый",
                 "коричневый", "оранжевый", "фиолетовый", "не определен"],
    "тип_верх": ["куртка", "пальто", "жилет", "толстовка", "футболка", "рубашка", "платье", "не определен"],
    "тип_низ": ["брюки", "юбка", "шорты", "не определен"],
    "сумка_спина": ["да", "отсутствует", "не определен"],
    "сумка_рука": ["да", "отсутствует", "не определен"]
}

# Веса для Focal Loss
FOCAL_WEIGHTS = {
    "пол": 1.0,
    "возраст": 3.0,
    "голов_убор": 1.0,
    "цвет_верх": 2.0,
    "цвет_низ": 2.5,
    "тип_верх": 1.5,
    "тип_низ": 0.8,
    "сумка_спина": 1.0,
    "сумка_рука": 1.3
}
